Repository: westes/flex
Catalog: po/*.po
Languages: bg

source: Allocation of buffer to print string failed
bg: Неуспешно заделяне на буфер за отпечатване на низ

source: State #%d is non-accepting -
bg: Състояние №%d е неприемащо —

source: dangerous trailing context
bg: опасен последващ контекст

source: associated rule line numbers:
bg: номера на редове на съответното правило:

source: out-transitions:
bg: изходящи преходи:

source: jam-transitions: EOF
bg: обобщени преходи: край на файл

source: consistency check failed in epsclosure()
bg: неуспешна проверка за консистентност в „epsclosure()“

source: DFA Dump:
bg: Извеждане на ДКА:

source: could not create unique end-of-buffer state
bg: уникалното състояние за край на буфер не може да се създаде

source: state # %d:
bg: състояние №%d:

source: Could not write yynxt_tbl[][]
bg: „yynxt_tbl[][]“ не може да се запише

source: bad transition character detected in sympartition()
bg: в „sympartition()“ има неправилен знак за преход

source: Equivalence Classes:
bg: Класове на еквивалентност:

source: state # %d accepts: [%d]
bg: състояние №%d приема: [%d]

source: state # %d accepts:
bg: състояние №%d приема:

source: Could not write yyacclist_tbl
bg: „yyacclist_tbl“ не може да се запише

source: Could not write yyacc_tbl
bg: „yyacc_tbl“ не може да се запише

source: Could not write ecstbl
bg: „ecstbl“ не може да се запише

source: Meta-Equivalence Classes:
bg: Класове за мета-еквивалентност:

source: Could not write yymeta_tbl
bg: „yymeta_tbl“ не може да се запише

source: Could not write yybase_tbl
bg: „yybase_tbl“ не може да се запише

source: Could not write yydef_tbl
bg: „yydef_tbl“ не може да се запише

source: Could not write yynxt_tbl
bg: „yynxt_tbl“ не може да се запише

source: Could not write yychk_tbl
bg: „yychk_tbl“ не може да се запише

source: Could not write ftbl
bg: „ftbl“ не може да се запише

source: Could not write ssltbl
bg: „ssltbl“ не може да се запише

source: Could not write eoltbl
bg: „eoltbl“ не може да се запише

source: Could not write yynultrans_tbl
bg: „yynultrans_tbl“ не може да се запише

source: rule cannot be matched
bg: правилото не напасва

source: -s option given but default rule can be matched
bg: зададена е опцията „-s“, но стандартното правило напасва

source: Can't use -+ with -l option
bg: опциите „-+“ и „-l“ са несъвместими

source: Can't use -f or -F with -l option
bg: опциите „-f“/„-F“ и „-l“ са несъвместими

source: -Cf/-CF and -Cm don't make sense together
bg: опциите „-Cf“/„-CF“ и „-Cm“ са несъвместими

source: -Cf/-CF and -I are incompatible
bg: опциите „-Cf“/„-CF“ и „-I“ са несъвместими

source: -Cf/-CF are incompatible with lex-compatibility mode
bg: опциите „-Cf“/„-CF“ са несъвместими с режима за съвместимост с „lex“

source: -Cf and -CF are mutually exclusive
bg: опциите „-Cf“ и „-CF“ са несъвместими

source: Can't use -+ with -CF option
bg: опциите „-+“ и „-CF“ са несъвместими

source: %array incompatible with -+ option
bg: опцията „-+“ e несъвместима с декларация „%array“

source: Options -+ and --reentrant are mutually exclusive.
bg: Опциите „-+“ и „--reentrant“ са несъвместими.

source: bison bridge not supported for the C++ scanner.
bg: анализатори, които са на C++, не поддържат допълнителната поддръжка за „bison“.

source: could not create %s
bg: „%s“ не може да се създаде

source: %option yyclass only meaningful for C++ scanners
bg: директивата за „%option“ — „yyclass“ важи само за анализаторите, които са на C++

source: input error reading skeleton file %s
bg: входна грешка при изчитане на скелетния файл „%s“

source: error closing skeleton file %s
bg: грешка при затваряне на скелетния файл „%s“

source: error writing output file %s
bg: грешка при записването на изходния файл „%s“

source: error closing output file %s
bg: грешка при затварянето на изходния файл „%s“

source: error deleting output file %s
bg: грешка при изтриването на изходния файл „%s“

source: No backing up.
bg: Без връщане назад.

source: %d backing up (non-accepting) states.
bg: %d състояния за връщане (неприемащи)

source: Compressed tables always back up.
bg: Компресираните таблици винаги водят до връщане назад.

source: error writing backup file %s
bg: грешка при записа на файла с връщанията назад „%s“

source: error closing backup file %s
bg: грешка при затварянето на файла с връщанията назад „%s“

source: %s version %s usage statistics:
bg: Статистика за употреба на %s, версия %s:

source: scanner options: -
bg: опции на лексическия анализатор: -

source: %d/%d NFA states
bg: %d/%d състояния на НКА

source: %d/%d DFA states (%d words)
bg: %d/%d състояния на ДКА (%d думи)

source: %d rules
bg: %d правила

source: No backing up
bg: Без връщане назад

source: %d backing-up (non-accepting) states
bg: %d състояния за връщане (неприемащи)

source: Compressed tables always back-up
bg: Компресираните таблици винаги водят до връщане

source: Beginning-of-line patterns used
bg: Използвани са правила за начало на ред

source: %d/%d start conditions
bg: %d/%d начални състояния

source: %d epsilon states, %d double epsilon states
bg: %d ε-състояния, %d двойни ε-състояния

source: no character classes
bg: няма класове знаци

source: %d/%d character classes needed %d/%d words of storage, %d reused
bg: %d/%d класове за знаци изискваха %d/%d думи за съхранение, преизползвани са %d

source: %d state/nextstate pairs created
bg: %d двойки състояние/преход

source: %d/%d unique/duplicate transitions
bg: %d/%d уникални/повтарящи се преходи

source: %d table entries
bg: %d таблични записи

source: %d/%d base-def entries created
bg: %d/%d записи за основни дефиниции

source: %d/%d (peak %d) nxt-chk entries created
bg: %d/%d (максимум %d) записи

source: %d/%d (peak %d) template nxt-chk entries created
bg: %d/%d (максимум %d) шаблонни записи

source: %d empty table entries
bg: %d празни таблични записи

source: %d protos created
bg: %d създадени прототипи

source: %d templates created, %d uses
bg: %d създадени шаблони, %d употреби

source: %d/%d equivalence classes created
bg: създадени са %d/%d класове за еквивалентност

source: %d/%d meta-equivalence classes created
bg: създадени са %d/%d класове за мета-еквивалентност

source: %d (%d saved) hash collisions, %d DFAs equal
bg: %d (%d запазени) конфликти по суми, %d ДКА са еднакви

source: %d sets of reallocations needed
bg: необходими са %d пъти заделяния на памет наново

source: %d total table entries needed
bg: необходими са общо %d записи в таблица

source: Internal error. flexopts are malformed.
bg: Вътрешна грешка. Неправилни опции за flex.

source: Try `%s --help' for more information.
bg: За повече информация изпълнете „%s --help“.

source: unknown -C option '%c'
bg: непозната опция към „-C“: „%c“

source: fatal parse error
bg: фатална грешка на анализатора

source: could not write tables header
bg: заглавният файл за таблиците не може за се запише

source: can't open skeleton file %s
bg: скелетният файл „%s“ не може да се отвори

source: Prefix cannot include '[' or ']'
bg: Префиксът не трябва да съдържа „[“ или „]“

source: could not create backing-up info file %s
bg: файлът с информация за връщане назад не може да се създаде: „%s“

source: -l AT&T lex compatibility option entails a large performance penalty
bg: опцията за съвместимост с „lex“ на AT&T: „-l“, води до голяма загуба на производителност

source: and may be the actual source of other reported performance penalties
bg: и може да доведе до допълнителни проблеми с производителността

source: %%option yylineno entails a performance penalty ONLY on rules that can match newline characters
bg: директивата за „%%option“ — „yylineno“ води до загуба на производителност, само за правилата, които напасват знак за нов ред

source: -I (interactive) entails a minor performance penalty
bg: „-I“ (интерактивният режим) води до малка загуба на производителност

source: yymore() entails a minor performance penalty
bg: „yymore()“ води до малка загуба на производителност

source: REJECT entails a large performance penalty
bg: Отхвърлянето (REJECT) води до голяма загуба на производителност

source: Variable trailing context rules entail a large performance penalty
bg: Правила с последващ контекст, който не е константен, водят до голяма загуба на производителност

source: REJECT cannot be used with -f or -F
bg: Отхвърлянето (REJECT) е несъвместимо с „-f“ или „-F“

source: %option yylineno cannot be used with REJECT
bg: директивата за „%option“ — „yylineno“ е несъвместима с отхвърляне (REJECT)

source: variable trailing context rules cannot be used with -f or -F
bg: правила с последващ контекст, който не е константен, не може да се ползват заедно с „-f“ или „-F“

source: allocation of macro definition failed
bg: неуспешно заделяне на памет за дефиниция на макрос

source: Usage: %s [OPTIONS] [FILE]...
bg: Употреба: %s [ОПЦИЯ] [ФАЙЛ]…

source: memory allocation failed in allocate_array()
bg: неуспешно заделяне на памет в „allocate_array()“

source: bad character '%s' detected in check_char()
bg: „check_char()“ се натъкна на неправилен знак: „%s“

source: scanner requires -8 flag to use the character %s
bg: опцията „-8“ е задължителна, за да ползвате знака „%s“ в анализатора

source: memory allocation failure in xstrdup()
bg: неуспешно заделяне на памет в „xstrdup()“

source: %s: fatal internal error, %s
bg: %s: фатална вътрешна грешка — %s

source: attempt to increase array size failed
bg: неуспешен опит за увеличаване на размер на масив

source: memory allocation failed in yy_flex_xmalloc()
bg: неуспешно заделяне на памет в „yy_flex_xmalloc()“

source: ********** beginning dump of nfa with start state %d
bg: •••••••••• начало на извеждането на НКА с начално състояние %d

source: state # %4d
bg: състояние №%4d

source: ********** end of dump
bg: •••••••••• край на извеждането

source: empty machine in dupmachine()
bg: празна машина в „dupmachine()“

source: Variable trailing context rule at line %d
bg: Правило с последващ контекст, който не е константен, на ред %d

source: bad state type in mark_beginning_as_normal()
bg: неправилен вид състояние в „mark_beginning_as_normal()“

source: input rules are too complicated (>= %d NFA states)
bg: входните правила са прекалено сложни (≥ %d състояния на НКА)

source: found too many transitions in mkxtion()
bg: прекалено много преходи в „mkxtion()“

source: too many rules (> %d)!
bg: прекалено много правила (> %d)!

source: unknown error processing section 1
bg: непозната грешка при обработка на 1ви раздел

source: bad start condition list
bg: неправилен списък на началните състояния

source: Prefix must not contain [ or ]
bg: Префиксът не трябва да съдържа „[“ или „]“

source: unrecognized rule
bg: непознато правило

source: trailing context used twice
bg: двукратно ползване на последващ контекст

source: bad iteration values
bg: неправилни стойности на итерация

source: iteration value must be positive
bg: стойността на итерацията трябва да е положителна

source: the character range [%c-%c] is ambiguous in a case-insensitive scanner
bg: диапазонът знаци [%c-%c] не е еднозначен при лексичен анализатор, който не прави разлика между главни и малки знаци

source: negative range in character class
bg: изключващ диапазон в клас знаци

source: [:^lower:] is ambiguous in case insensitive scanner
bg: диапазонът знаци [:^lower:] не е еднозначен при лексичен анализатор, който не прави разлика между главни и малки знаци

source: [:^upper:] ambiguous in case insensitive scanner
bg: диапазонът знаци [:^upper:] не е еднозначен при лексичен анализатор, който не прави разлика между главни и малки знаци

source: Input line too long
bg: Входният ред е твърде дълъг

source: malformed '%top' directive
bg: неправилна директива „%top“

source: unrecognized '%' directive
bg: непозната директива, започваща с „%“

source: Definition name too long
bg: Името на дефиницията е твърде дълго

source: Unmatched '{'
bg: „{“ без еш

source: Definition value for {%s} too long
bg: Стойността на дефиницията „{%s}“ е твърде дълга

source: incomplete name definition
bg: дефиниция с непълно име

source: Option line too long
bg: Редът за опция е твърде дълъг

source: unrecognized %%option: %s
bg: непозната опция „%%option“: „%s“

source: bad character class
bg: неправилен клас знаци

source: undefined definition {%s}
bg: липсваща дефиниция „{%s}“

source: unbalanced parenthesis
bg: скоба без еш

source: bad <start condition>: %s
bg: лошо начално условие: „%s“

source: missing quote
bg: липсваща кавичка

source: bad character class expression: %s
bg: неправилен израз за клас от знаци: „%s“

source: bad character inside {}'s
bg: неправилен знак между „{“ и „}“

source: missing }
bg: липсва „}“

source: EOF encountered inside an action
bg: край на файл в действие

source: EOF encountered inside pattern
bg: край на файл в шаблон

source: bad character: %s
bg: неправилен знак: %s

source: can't open %s
bg: „%s“ не може да се отвори

source: Usage: %s [OPTIONS]...
bg: Употреба: %s [ОПЦИЯ]…

source: option `%s' doesn't allow an argument
bg: опцията „%s“ се използва без аргументи

source: option `%s' requires an argument
bg: опцията „%s“ изисква аргумент

source: option `%s' is ambiguous
bg: опцията „%s“ не е еднозначна

source: Unrecognized option `%s'
bg: непозната опция „%s“

source: Unknown error=(%d)
bg: Неизвестна грешка=(%d)

source: symbol table memory allocation failed
bg: неуспешно заделяне на памет за таблицата със символите

source: name defined twice
bg: името е дефинирано двукратно

source: start condition %s declared twice
bg: началното условие „%s“ е дефинирано двукратно

source: premature EOF
bg: преждевременен край (EOF)

source: End Marker
bg: Маркер за край

source: *Something Weird* - tok: %d val: %d
bg: •Нещо странно• — лекс.: %d ст-ст: %d
